openfoam_case/system/controlDict
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}

application		rhoSimpleFoam;
startFrom		startTime;
startTime		0;
stopAt			endTime;
endTime			200;
deltaT			0.1;
writeControl		runTime;
writeInterval		200;
purgeWrite 		0;
writeFormat		ascii;
writePrecision		6;
writeCompression	off;
timeFormat		general;
timePrecision		6;
runTimeModifiable	false;