openfoam_case/constant/blockMeshDict
FoamFile
{
  version     2.0;
  format      ascii;
  class       dictionary;
  object      blockMeshDict;
}

vertices (
	  (-1 -1 0) // 0
	  (1 -1 0) // 1 
	  (1 1 0) // 2
	  (-1 1 0) // 3
	  (-1 -1 1) // 4
	  (1 -1 1) // 5
	  (1 1 1) // 6
	  (-1 1 1) // 7
);

blocks
( hex (0 1 2 3 4 5 6 7) (200 200 200) simpleGrading (50 50 50) 
);

edges
(
);

boundary
(
 Walls
 {
   type wall;
   faces
     (
      (4 5 6 7)
      (0 1 2 3)
      (2 6 5 1)
      (0 4 7 3)
      );
 }
 
 the_Inlet
 {
   type Inlet;
   faces
     (
      (1 5 4 0)
      );
 }
 the_Outlet
 {
   type Outlet;
   faces
     (
      (3 7 6 2)
      );
 }
);


mergePatchPairs
(
);
