openfoam_case/0/p
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p;
}

dimensions  [1 -1 -2 0 0 0 0];

internalField uniform 100000;

boundaryField
{
	Walls{
	type zeroGradient;
	}
	the_Inlet{
	type zeroGradient;
	}
	the_Outlet{
	type fixedValue;
	value uniform 100000;
	}
	Geo{
	type zeroGradient;
	}
}