openfoam_case/0/epsilon
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      epsilon;
}

dimensions      [ 0 2 -3 0 0 0 0 ];

internalField uniform 200;

boundaryField
{
	Walls {
	type compressible::epsilonWallFunction;
	value uniform 200;
	}

	Geo {
	type compressible::epsilonWallFunction;
	value uniform 200;
	}
	
	the_Inlet {
	type compressible::turbulentMixingLengthDissipationRateInlet;
	mixingLength 0.005;
	value uniform 200;
	}

	the_Outlet {
	type            inletOutlet;
        inletValue      uniform 200;
        value           uniform 200;
    	}
}